app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('R')
---
    end

    if @ratings and @sort_by
      @movies = Movie.where(:rating => @ratings.keys).find(:all, :order => (@sort_by))

SELECT "movies".* FROM "movies" ORDER BY release_date
---
    elsif @sort_by
      @movies = Movie.find(:all, :order => (@sort_by))
    else
      @movie = Movie.all